{
  "Menu": "Menu",
  "Sign Out": "Déconnexion",
  "Backoffice": "Backoffice",
  "My Settings": "Mes paramètres",
  "My Addresses": "Mes adresses",
  "My Wallet": "Mon portefeuille",
  "My Orders": "Mes commandes",
  "Home": "Accueil",
  "Terms of Services": "Conditions d'utilisation",
  "Legal Notice": "Mentions légales",
  "Contact": "Contact",
  "About ÀIRNEIS": "À propos de ÀIRNEIS",
  "About": "À propos",
  "Sign In": "Connexion",
  "Sign Up": "Inscription",
  "Search": "Recherche",
  "Cart": "Panier",
  "Sections": "Sections",
  "Shop": "Boutique",
  "Categories": "Catégories",
  "Subscribe to our newsletter": "Abonnez-vous à notre newsletter",
  "Monthly digest of what's new and exciting from us.": "Résumé mensuel de nos nouveautés et actualités.",
  "All rights reserved.": "Tous droits réservés.",
  "Coming soon": "Bientôt disponible",

  "Error loading categories": "Erreur de chargement des catégories",
  "Error loading featured products": "Erreur de chargement des produits phares",
  "Categories data is not valid": "Les données des catégories ne sont pas valides",
  "Featured products data is not valid": "Les données des produits phares ne sont pas valides",
  "FROM THE HIGHLANDS OF SCOTLAND": "DES HAUTES TERRES D'ÉCOSSE",
  "OUR FURNITURE IS IMMORTAL": "NOS MEUBLES SONT ÉTERNELS",
  "THE HIGHLANDERS OF THE MOMENT": "LES HIGHLANDERS DU MOMENT",

  "Terms of Use": "Conditions d'utilisation",
  "By using our site, you agree to the following terms of use:": "En utilisant notre site, vous acceptez les conditions d'utilisation suivantes :",
  "You must not use our site in an illegal or malicious manner.": "Vous ne devez pas utiliser notre site de manière illégale ou malveillante.",
  "You must not attempt to gain unauthorized access to our site.": "Vous ne devez pas tenter d'obtenir un accès non autorisé à notre site.",
  "You must not use our site to transmit viruses or other malicious software.": "Vous ne devez pas utiliser notre site pour transmettre des virus ou autres logiciels malveillants.",
  "You must not use our site to harass, insult, or harm others.": "Vous ne devez pas utiliser notre site pour harceler, insulter ou nuire à autrui.",

  "Name": "Nom",
  "Email": "E-mail",
  "Password": "Mot de passe",
  "Confirm Password": "Confirmer le mot de passe",
  "Passwords do not match": "Les mots de passe ne correspondent pas",
  "Already have an account?": "Vous avez déjà un compte ?",

  "Forgot Password?": "Mot de passe oublié ?",
  "Show Password": "Afficher le mot de passe",
  "New customer?": "Nouveau client ?",
  "Create your account": "Créez votre compte",

  "Full Name": "Nom complet",
  "Phone Number": "Numéro de téléphone",
  "Address": "Adresse",
  "City": "Ville",
  "Postal Code": "Code postal",
  "Country": "Pays",
  "Select Country": "Sélectionnez le pays",
  "Continue": "Continuer",
  "Loading...": "Chargement...",
  "Error fetching one user": "Erreur lors de la récupération d'un utilisateur",
  "Default": "Défaut",
  "Shipping Address": "Adresse de livraison",

  "searchResults": "Résultats de recherche",
  "search": "Rechercher",
  "filter": "Filtrer",
  "searchPlaceholder": "Que cherchez-vous ?",
  "filters": "Filtres",
  "minimumPrice": "Prix minimum",
  "minPrice": "Prix min",
  "maximumPrice": "Prix maximum",
  "maxPrice": "Prix max",
  "categories": "Catégories",
  "loadingCategories": "Chargement des catégories...",
  "errorLoadingCategories": "Erreur lors du chargement des catégories",
  "materials": "Matériaux",
  "loadingMaterials": "Chargement des matériaux...",
  "errorLoadingMaterials": "Erreur lors du chargement des matériaux",
  "sortBy": "Trier par",
  "default": "Défaut",
  "price": "Prix",
  "newest": "Le plus récent",
  "inStock": "En stock",
  "sortOrder": "Ordre de tri",
  "ascending": "Ascendant",
  "descending": "Descendant",
  "applyFilters": "Appliquer les filtres",
  "resetFilters": "Réinitialiser les filtres",
  "results": "Résultats",
  "loading": "Chargement...",
  "errorFetchingResults": "Erreur lors de la récupération des résultats",
  "noResultsFound": "Aucun résultat trouvé",

  "Profile": "Profil",
  "Update": "Mettre à jour",
  "Profile updated": "Profil mis à jour",

  "Sorry. Product is out of stock": "Désolé. Produit en rupture de stock",
  "Product added to cart": "Produit ajouté au panier",
  "Product Not Found": "Produit non trouvé",
  "Price": "Prix",
  "Description": "Description",
  "Status": "Statut",
  "In Stock": "En stock",
  "Unavailable": "Indisponible",
  "Add to Cart": "Ajouter au panier",
  "Out of Stock": "En rupture de stock",

  "Place Order": "Passer commande",
  "Preview Order": "Aperçu de la commande",
  "Shipping": "Expédition",
  "Edit": "Modifier",
  "Payment": "Paiement",
  "Method": "Méthode",
  "Items": "Articles",
  "Order Summary": "Résumé de la commande",
  "Total": "Total",
  "Tax": "Taxe",
  "Unexpected response structure from order creation API.": "Structure de réponse inattendue de l'API de création de commande",

  "Card": "Carte",
  "Payment Method": "Méthode de paiement",
  "Bank Name": "Nom de la banque",
  "Card Number": "Numéro de carte",
  "Year Expiration": "Année d'expiration",
  "CCV": "CCV",

  "Order": "Commande",
  "Order Not Found": "Commande non trouvée",
  "Delivered at": "Livré le",
  "Not Delivered": "Non livré",
  "Paid at": "Payé le",
  "Not Paid": "Non payé",

  "Order History": "Historique des commandes",
  "ID": "ID",
  "DATE": "DATE",
  "TOTAL": "TOTAL",
  "PAID": "PAYÉ",
  "DELIVERED": "LIVRÉ",
  "ACTIONS": "ACTIONS",
  "Details": "Détails",
  "N/A": "N/D",
  "No": "Non",

  "Wallet": "Portefeuille",
  "List of Payment Cards": "Liste des cartes de paiement",
  "Add Card": "Ajouter une carte",
  "Card Holder": "Titulaire de la carte",
  "Expires": "Expire",
  "Expiration Date": "Date d'expiration",

  "Company Name": "Nom de l'entreprise",
  "Company Registration Number": "Numéro d'enregistrement de l'entreprise",
  "Publication Director": "Directeur de la publication",
  "Hosting Provider": "Fournisseur d'hébergement",

  "errorLoadingFeaturedProducts": "Erreur lors du chargement des produits phares",

  "Subject": "Sujet",
  "Message": "Message",
  "Send": "Envoyer",
  "New message sent": "Nouveau message envoyé",

  "Shopping Cart": "Panier",
  "Cart is empty.": "Le panier est vide.",
  "Go Shopping": "Faire des achats",
  "Subtotal": "Sous-total",
  "items": "articles",
  "Proceed to Checkout": "Passer à la caisse",

  "Addresses": "Adresses",
  "Saved addresses": "Adresses enregistrées",
  "Add a new address": "Ajouter une nouvelle adresse",
  "Street": "Rue",
  "Default shipping address": "Adresse de livraison par défaut",
  "Create new": "Créer",

  "Our Story": "Notre histoire",
  "In the heart of Scotland, where the whispers of the past meet the innovations of the future, ÀIRNEIS was born. Our name, meaning \"furniture\" in Scottish Gaelic, is a tribute to our roots and a symbol of our commitment to bringing the dreams of Scotland's most visionary designers to life. Our collection is a curated symphony of timeless classics and modern masterpieces, each piece crafted with love, care, and unparalleled attention to detail.": "Au cœur de l'Écosse, où les murmures du passé rencontrent les innovations du futur, ÀIRNEIS est née. Notre nom, signifiant \"meubles\" en gaélique écossais, est un hommage à nos racines et un symbole de notre engagement à réaliser les rêves des designers les plus visionnaires d'Écosse. Notre collection est une symphonie soigneusement sélectionnée de classiques intemporels et de chefs-d'œuvre modernes, chaque pièce étant fabriquée avec amour, soin et une attention aux détails sans pareil.",
  "From our humble beginnings as a small, family-run business, ÀIRNEIS has always been more than just a furniture company. It's a legacy of craftsmanship, a celebration of Scottish heritage, and a journey of innovation. We started by sharing our creations through mail order and a handful of partner retailers, cherishing every connection made, every piece that found a new home.": "Depuis nos humbles débuts en tant que petite entreprise familiale, ÀIRNEIS a toujours été plus qu'une simple entreprise de meubles. C'est un héritage de l'artisanat, une célébration du patrimoine écossais et un voyage d'innovation. Nous avons commencé par partager nos créations par correspondance et avec quelques détaillants partenaires, chérissant chaque connexion établie, chaque pièce trouvant un nouveau foyer.",
  "Embracing the winds of change, we've recently taken a bold step into the digital world with the launch of our online store. This new chapter allows us to weave our stories into the fabric of homes around the globe, connecting with those who share our passion for design that transcends time and borders. It's an invitation to discover the perfect piece that speaks to you, to bring a piece of Scotland into your life.": "Embrassant les vents du changement, nous avons récemment fait un pas audacieux dans le monde numérique avec le lancement de notre boutique en ligne. Ce nouveau chapitre nous permet d'intégrer nos histoires dans le tissu des foyers du monde entier, en nous connectant avec ceux qui partagent notre passion pour un design qui transcende le temps et les frontières. C'est une invitation à découvrir la pièce parfaite qui vous parle, à apporter un morceau de l'Écosse dans votre vie.",
  "Your joy and satisfaction fuel our journey, and we are here to guide, inspire, and listen. Welcome to ÀIRNEIS, a place where tradition dances with innovation, and every piece tells a story waiting to become a part of yours.": "Votre joie et votre satisfaction alimentent notre voyage, et nous sommes ici pour guider, inspirer et écouter. Bienvenue chez ÀIRNEIS, un lieu où la tradition danse avec l'innovation, et chaque pièce raconte une histoire qui attend de devenir une partie de la vôtre.",
  "With heartfelt warmth,": "Avec une chaleur sincère,",
  "The ÀIRNEIS Family": "La famille ÀIRNEIS",

  "Please enter a valid email address.": "Veuillez entrer une adresse e-mail valide.",
  "Send Reset Link": "Envoyer un lien de réinitialisation",
  "Failed to send reset link": "Échec de l'envoi du lien de réinitialisation",
  "Check your email for the reset link. You will be redirected to the sign-in page shortly.": "Vérifiez votre boîte mail pour le lien de réinitialisation. Vous serez redirigé vers la page de connexion sous peu.",

  "New Password": "Nouveau mot de passe",
  "Reset Password": "Réinitialiser le mot de passe",

  "Sofas": "Canapés",
  "Tables": "Tables",
  "Bookcases": "Bibliothèques",
  "Rugs": "Tapis",
  "Lamps": "Lampes",
  "Wardrobes": "Armoires",
  
  "Cotton": "Coton",
  "Wood": "Bois",
  "Metal": "Métal",
  "Wool": "Laine",
  "Glass": "Verre",

  "Discover the beauty of outdoor living with our garden range": "Découvrez la beauté de la vie en plein air avec notre gamme de jardin",
  "Explore our latest bedroom furniture collections": "Explorez nos dernières collections de meubles de chambre",
  "Transform your living space with our contemporary designs": "Transformez votre espace de vie avec nos designs contemporains",
  
  "Discover the ultimate comfort with our luxurious sofa collection, perfect for elevating your living space.": "Découvrez le confort ultime avec notre collection de canapés luxueux, parfaite pour rehausser votre espace de vie.",
  "Elevate your dining experience with our stylish and functional tables, designed to fit any space.": "Élevez votre expérience culinaire avec nos tables élégantes et fonctionnelles, conçues pour s'adapter à tout espace.",
  "Organize your favorite reads and accentuate your space with our elegant and versatile bookcases.": "Organisez vos lectures favorites et accentuez votre espace avec nos bibliothèques élégantes et polyvalentes.",
  "Add a touch of warmth and style to any room with our exquisite collection of rugs.": "Ajoutez une touche de chaleur et de style à toute pièce avec notre collection exquise de tapis.",
  "Illuminate your home with our range of beautiful and functional lamps, perfect for setting the mood.": "Illuminez votre maison avec notre gamme de lampes belles et fonctionnelles, parfaites pour créer une ambiance.",
  "Keep your clothes organized and your bedroom tidy with our stylish and spacious wardrobes.": "Gardez vos vêtements organisés et votre chambre ordonnée avec nos armoires élégantes et spacieuses.",

  "Sign-In": "Connexion",
  "We use functional cookies to ensure the best experience on our website.": "Nous utilisons des cookies fonctionnels pour garantir la meilleure expérience sur notre site Web.",
  "OK": "OK",
  "Back to Sign In": "Retour à la connexion",
  "Processing your request...": "Traitement de votre demande...",
  "Reset link has been sent to your email. You will be redirected to the sign-in page shortly.": "Un lien de réinitialisation a été envoyé à votre adresse e-mail. Vous serez redirigé vers la page de connexion sous peu.",
  "Password reset successful. You will be redirected to the login page in a few seconds.": "Réinitialisation du mot de passe réussie. Vous serez redirigé vers la page de connexion dans quelques secondes.",

  "Password Strength": "Force du mot de passe",
  "Weak": "Faible",
  "Strong": "Fort",
  "Password must be at least 8 characters long.": "Le mot de passe doit contenir au moins 8 caractères.",
  "Password should include at least one letter.": "Le mot de passe doit inclure au moins une lettre.",
  "Password should include at least one number.": "Le mot de passe doit inclure au moins un chiffre.",
  "Password should include at least one special character.": "Le mot de passe doit inclure au moins un caractère spécial."
}

