{
  "Menu": "Thực đơn",
  "Sign Out": "Đăng xuất",
  "Backoffice": "Văn phòng phía sau",
  "My Settings": "Cài đặt của tôi",
  "My Addresses": "Địa chỉ của tôi",
  "My Wallet": "Ví của tôi",
  "My Orders": "Đơn hàng của tôi",
  "Home": "Trang chủ",
  "Terms of Services": "Điều khoản dịch vụ",
  "Legal Notice": "Thông báo pháp lý",
  "Contact": "Liên hệ",
  "About ÀIRNEIS": "Về ÀIRNEIS",
  "About": "Giới thiệu",
  "Sign In": "Đăng nhập",
  "Sign Up": "Đăng ký",
  "Search": "Tìm kiếm",
  "Cart": "Giỏ hàng",
  "Sections": "Các mục",
  "Shop": "Cửa hàng",
  "Categories": "Danh mục",
  "Subscribe to our newsletter": "Đăng ký nhận bản tin",
  "Monthly digest of what's new and exciting from us.": "Tóm tắt hàng tháng về những điều mới mẻ và thú vị từ chúng tôi.",
  "All rights reserved.": "Bản quyền đã được bảo hộ.",
  "Coming soon": "Sắp có",

  "Error loading categories": "Lỗi tải danh mục",
  "Error loading featured products": "Lỗi tải sản phẩm nổi bật",
  "Categories data is not valid": "Dữ liệu danh mục không hợp lệ",
  "Featured products data is not valid": "Dữ liệu sản phẩm nổi bật không hợp lệ",
  "FROM THE HIGHLANDS OF SCOTLAND": "TỪ CAO NGUYÊN SCOTLAND",
  "OUR FURNITURE IS IMMORTAL": "ĐỒ NỘI THẤT CỦA CHÚNG TÔI LÀ BẤT TỬ",
  "THE HIGHLANDERS OF THE MOMENT": "NGƯỜI CAO NGUYÊN CỦA THỜI ĐIỂM",

  "Terms of Use": "Điều khoản sử dụng",
  "By using our site, you agree to the following terms of use:": "Bằng cách sử dụng trang web của chúng tôi, bạn đồng ý với các điều khoản sử dụng sau:",
  "You must not use our site in an illegal or malicious manner.": "Bạn không được sử dụng trang web của chúng tôi theo cách bất hợp pháp hoặc ác ý.",
  "You must not attempt to gain unauthorized access to our site.": "Bạn không được cố gắng truy cập trái phép vào trang web của chúng tôi.",
  "You must not use our site to transmit viruses or other malicious software.": "Bạn không được sử dụng trang web của chúng tôi để truyền bá virus hoặc phần mềm độc hại khác.",
  "You must not use our site to harass, insult, or harm others.": "Bạn không được sử dụng trang web của chúng tôi để quấy rối, xúc phạm hoặc làm tổn hại đến người khác.",

  "Name": "Tên",
  "Email": "Email",
  "Password": "Mật khẩu",
  "Confirm Password": "Xác nhận mật khẩu",
  "Passwords do not match": "Mật khẩu không khớp",
  "Already have an account?": "Bạn đã có tài khoản?",

  "Forgot Password?": "Quên mật khẩu?",
  "Show Password": "Hiển thị mật khẩu",
  "New customer?": "Khách hàng mới?",
  "Create your account": "Tạo tài khoản của bạn",

  "Full Name": "Tên đầy đủ",
  "Phone Number": "Số điện thoại",
  "Address": "Địa chỉ",
  "City": "Thành phố",
  "Postal Code": "Mã bưu điện",
  "Country": "Quốc gia",
  "Select Country": "Chọn quốc gia",
  "Continue": "Tiếp tục",
  "Loading...": "Đang tải...",
  "Error fetching one user": "Lỗi tải một người dùng",
  "Default": "Mặc định",
  "Shipping Address": "Địa chỉ giao hàng",

  "searchResults": "kết quả tìm kiếm",
  "search": "tìm kiếm",
  "filter": "bộ lọc",
  "searchPlaceholder": "Bạn đang tìm gì?",
  "filters": "bộ lọc",
  "minimumPrice": "giá tối thiểu",
  "minPrice": "giá nhỏ nhất",
  "maximumPrice": "giá tối đa",
  "maxPrice": "giá lớn nhất",
  "categories": "danh mục",
  "loadingCategories": "đang tải danh mục",
  "errorLoadingCategories": "lỗi tải danh mục",
  "materials": "vật liệu",
  "loadingMaterials": "đang tải vật liệu",
  "errorLoadingMaterials": "lỗi tải vật liệu",
  "sortBy": "sắp xếp theo",
  "default": "mặc định",
  "price": "giá",
  "newest": "mới nhất",
  "inStock": "có sẵn",
  "sortOrder": "thứ tự sắp xếp",
  "ascending": "tăng dần",
  "descending": "giảm dần",
  "applyFilters": "áp dụng bộ lọc",
  "resetFilters": "đặt lại bộ lọc",
  "results": "kết quả",
  "loading": "đang tải",
  "errorFetchingResults": "lỗi tải kết quả",
  "noResultsFound": "không tìm thấy kết quả",

  "Profile": "Hồ sơ",
  "Update": "Cập nhật",
  "Profile updated": "Hồ sơ đã được cập nhật",

  "Sorry. Product is out of stock": "Xin lỗi. Sản phẩm đã hết hàng",
  "Product added to cart": "Sản phẩm đã được thêm vào giỏ hàng",
  "Product Not Found": "Không tìm thấy sản phẩm",
  "Price": "Giá",
  "Description": "Mô tả",
  "Status": "Trạng thái",
  "In Stock": "Có sẵn",
  "Unavailable": "Không có sẵn",
  "Add to Cart": "Thêm vào giỏ hàng",

  "Place Order": "Đặt hàng",
  "Preview Order": "Xem trước đơn hàng",
  "Shipping": "Vận chuyển",
  "Edit": "Chỉnh sửa",
  "Payment": "Thanh toán",
  "Method": "Phương thức",
  "Items": "Mặt hàng",
  "Order Summary": "Tóm tắt đơn hàng",
  "Total": "Tổng",
  "Tax": "Thuế",
  "Unexpected response structure from order creation API.": "Cấu trúc phản hồi không mong đợi từ API tạo đơn hàng.",

  "Card": "Thẻ",
  "Payment Method": "Phương thức thanh toán",
  "Bank Name": "Tên ngân hàng",
  "Card Number": "Số thẻ",
  "Year Expiration": "Năm hết hạn",
  "CCV": "CCV",

  "Order": "Đơn hàng",
  "Order Not Found": "Không tìm thấy đơn hàng",
  "Delivered at": "Giao hàng tại",
  "Not Delivered": "Chưa giao hàng",
  "Paid at": "Thanh toán tại",
  "Not Paid": "Chưa thanh toán",

  "Order History": "Lịch sử đơn hàng",
  "ID": "ID",
  "DATE": "NGÀY",
  "TOTAL": "TỔNG",
  "PAID": "ĐÃ THANH TOÁN",
  "DELIVERED": "ĐÃ GIAO",
  "ACTIONS": "HÀNH ĐỘNG",
  "Details": "Chi tiết",
  "N/A": "Không có",
  "No": "Không",

  "Wallet": "Ví",
  "List of Payment Cards": "Danh sách thẻ thanh toán",
  "Add Card": "Thêm thẻ",
  "Card Holder": "Chủ thẻ",
  "Expires": "Hết hạn",
  "Expiration Date": "Ngày hết hạn",

  "Company Name": "Tên công ty",
  "Company Registration Number": "Số đăng ký công ty",
  "Publication Director": "Giám đốc xuất bản",
  "Hosting Provider": "Nhà cung cấp dịch vụ lưu trữ",

  "errorLoadingFeaturedProducts": "lỗi tải sản phẩm nổi bật",

  "Subject": "Chủ đề",
  "Message": "Tin nhắn",
  "Send": "Gửi",
  "New message sent": "Tin nhắn mới đã được gửi",

  "Shopping Cart": "Giỏ hàng",
  "Cart is empty.": "Giỏ hàng trống.",
  "Go Shopping": "Đi mua sắm",
  "Subtotal": "Tổng phụ",
  "items": "mặt hàng",
  "Proceed to Checkout": "Tiến hành thanh toán",

  "Addresses": "Địa chỉ",
  "Saved addresses": "Địa chỉ đã lưu",
  "Add a new address": "Thêm địa chỉ mới",
  "Street": "Đường",
  "Default shipping address": "Địa chỉ giao hàng mặc định",
  "Create new": "Tạo mới",

  "Our Story": "Câu chuyện của chúng tôi",
  "In the heart of Scotland, where the whispers of the past meet the innovations of the future, ÀIRNEIS was born. Our name, meaning \"furniture\" in Scottish Gaelic, is a tribute to our roots and a symbol of our commitment to bringing the dreams of Scotland's most visionary designers to life. Our collection is a curated symphony of timeless classics and modern masterpieces, each piece crafted with love, care, and unparalleled attention to detail.": "Trong trái tim của Scotland, nơi những tiếng thì thầm của quá khứ gặp gỡ những đổi mới của tương lai, ÀIRNEIS đã được sinh ra. Tên của chúng tôi, có nghĩa là \"đồ nội thất\" trong tiếng Gaelic Scotland, là một lời tri ân đến nguồn gốc của chúng tôi và biểu tượng của cam kết mang đến những giấc mơ của những nhà thiết kế tầm nhìn nhất của Scotland thành hiện thực. Bộ sưu tập của chúng tôi là một bản giao hưởng được lựa chọn của những tác phẩm kinh điển vượt thời gian và kiệt tác hiện đại, mỗi món đồ được chế tác với tình yêu, sự chăm sóc và sự chú ý đến từng chi tiết không thể so sánh.",
  "From our humble beginnings as a small, family-run business, ÀIRNEIS has always been more than just a furniture company. It's a legacy of craftsmanship, a celebration of Scottish heritage, and a journey of innovation. We started by sharing our creations through mail order and a handful of partner retailers, cherishing every connection made, every piece that found a new home.": "Từ những bước đầu khiêm tốn của chúng tôi như một doanh nghiệp nhỏ do gia đình điều hành, ÀIRNEIS luôn là nhiều hơn một công ty đồ nội thất. Đó là di sản của nghề thủ công, là sự ăn mừng di sản Scotland, và là một hành trình đổi mới. Chúng tôi bắt đầu bằng cách chia sẻ các tạo tác của mình thông qua đặt hàng qua thư và một số nhà bán lẻ đối tác, trân trọng mỗi mối quan hệ được thiết lập, mỗi món đồ tìm thấy một ngôi nhà mới.",
  "Embracing the winds of change, we've recently taken a bold step into the digital world with the launch of our online store. This new chapter allows us to weave our stories into the fabric of homes around the globe, connecting with those who share our passion for design that transcends time and borders. It's an invitation to discover the perfect piece that speaks to you, to bring a piece of Scotland into your life.": "Ôm lấy những cơn gió của sự thay đổi, chúng tôi đã gần đây đã thực hiện một bước đi táo bạo vào thế giới số với việc ra mắt cửa hàng trực tuyến của mình. Chương mới này cho phép chúng tôi dệt những câu chuyện của mình vào nền tảng của các ngôi nhà trên khắp thế giới, kết nối với những người chia sẻ đam mê thiết kế của chúng tôi vượt qua thời gian và biên giới. Đây là lời mời để khám phá món đồ hoàn hảo nói lên điều bạn muốn, để mang một phần của Scotland vào cuộc sống của bạn.",
  "Your joy and satisfaction fuel our journey, and we are here to guide, inspire, and listen. Welcome to ÀIRNEIS, a place where tradition dances with innovation, and every piece tells a story waiting to become a part of yours.": "Niềm vui và sự hài lòng của bạn là nguồn động lực cho hành trình của chúng tôi, và chúng tôi ở đây để hướng dẫn, truyền cảm hứng và lắng nghe. Chào mừng bạn đến với ÀIRNEIS, nơi truyền thống nhảy múa với sự đổi mới, và mỗi món đồ kể một câu chuyện đang chờ đợi để trở thành một phần của bạn.",
  "With heartfelt warmth,": "Với lòng ấm áp chân thành,",
  "The ÀIRNEIS Family": "Gia đình ÀIRNEIS",

  "Sofas": "Ghế sofa",
  "Tables": "Bàn",
  "Bookcases": "Tủ sách",
  "Rugs": "Thảm",
  "Lamps": "Đèn",
  "Wardrobes": "Tủ quần áo",

  "Cotton": "Bông",
  "Wood": "Gỗ",
  "Metal": "Kim loại",
  "Wool": "Len",
  "Glass": "Kính",

  "Discover the beauty of outdoor living with our garden range": "Khám phá vẻ đẹp của cuộc sống ngoại thất với dòng sản phẩm vườn của chng tôi",
  "Explore our latest bedroom furniture collections": "Khám phá các bộ sản phẩm giường ngủ mới nhất của chng tôi",
  "Transform your living space with our contemporary designs": "Diễn đạt cuộc sống bằng các thiết kế hiện đại của chng tôi",
  
  "Discover the ultimate comfort with our luxurious sofa collection, perfect for elevating your living space.": "Khám phá vẻ đẹp của cuộc sống ngoại thất với dòng sản phẩm giường ngủ lịch thiệp của chng tôi",
  "Elevate your dining experience with our stylish and functional tables, designed to fit any space.": "Cải thiện trải nghiệm ăn sáng bằng các bộ sản phẩm bàn ăn hiện đại và tối ưu",
  "Organize your favorite reads and accentuate your space with our elegant and versatile bookcases.": "Đạt đến cuộc sống bằng các bộ sản phẩm bảng sách tinh tế và phát triển.",
  "Add a touch of warmth and style to any room with our exquisite collection of rugs.": "Thêm một cách lạnh mạnh và tinh tế vào bất kỳ phòng nào với bộ sản phẩm bồn bạn tinh tế.",
  "Illuminate your home with our range of beautiful and functional lamps, perfect for setting the mood.": "Đạt đến cuộc sống bằng các bộ sản phẩm lồng sống tinh tế và phát triển.",
  "Keep your clothes organized and your bedroom tidy with our stylish and spacious wardrobes.": "Giữ các vải sản phẩm đã được sắp xếp và bảng sách đã được sắp xếp."
}
