{
  "Menu": "Menú",
  "Sign Out": "Cerrar sesión",
  "Backoffice": "Oficina",
  "My Settings": "Mis configuraciones",
  "My Addresses": "Mis direcciones",
  "My Wallet": "Mi billetera",
  "My Orders": "Mis pedidos",
  "Home": "Inicio",
  "Terms of Services": "Términos de servicio",
  "Legal Notice": "Aviso legal",
  "Contact": "Contacto",
  "About ÀIRNEIS": "Acerca de ÀIRNEIS",
  "About": "Acerca de",
  "Sign In": "Iniciar sesión",
  "Sign Up": "Registrarse",
  "Search": "Buscar",
  "Cart": "Carrito",
  "Sections": "Secciones",
  "Shop": "Tienda",
  "Categories": "Categorías",
  "Subscribe to our newsletter": "Suscríbete a nuestro boletín",
  "Monthly digest of what's new and exciting from us.": "Resumen mensual de nuestras novedades y noticias.",
  "All rights reserved.": "Todos los derechos reservados.",
  "Coming soon": "Próximamente",

  "Error loading categories": "Error al cargar las categorías",
  "Error loading featured products": "Error al cargar los productos destacados",
  "Categories data is not valid": "Los datos de las categorías no son válidos",
  "Featured products data is not valid": "Los datos de los productos destacados no son válidos",
  "FROM THE HIGHLANDS OF SCOTLAND": "DESDE LAS TIERRAS ALTAS DE ESCOCIA",
  "OUR FURNITURE IS IMMORTAL": "NUESTROS MUEBLES SON INMORTALES",
  "THE HIGHLANDERS OF THE MOMENT": "LOS HIGHLANDERS DEL MOMENTO",

  "Terms of Use": "Términos de uso",
  "By using our site, you agree to the following terms of use:": "Al usar nuestro sitio, usted acepta los siguientes términos de uso:",
  "You must not use our site in an illegal or malicious manner.": "No debe usar nuestro sitio de manera ilegal o maliciosa.",
  "You must not attempt to gain unauthorized access to our site.": "No debe intentar acceder sin autorización a nuestro sitio.",
  "You must not use our site to transmit viruses or other malicious software.": "No debe usar nuestro sitio para transmitir virus u otro software malicioso.",
  "You must not use our site to harass, insult, or harm others.": "No debe usar nuestro sitio para acosar, insultar o dañar a otros.",

  "Name": "Nombre",
  "Email": "Correo electrónico",
  "Password": "Contraseña",
  "Confirm Password": "Confirmar contraseña",
  "Passwords do not match": "Las contraseñas no coinciden",
  "Already have an account?": "¿Ya tienes una cuenta?",

  "Forgot Password?": "¿Olvidaste la contraseña?",
  "Show Password": "Mostrar contraseña",
  "New customer?": "¿Nuevo cliente?",
  "Create your account": "Crea tu cuenta",

  "Full Name": "Nombre completo",
  "Phone Number": "Número de teléfono",
  "Address": "Dirección",
  "City": "Ciudad",
  "Postal Code": "Código postal",
  "Country": "País",
  "Select Country": "Seleccionar país",
  "Continue": "Continuar",
  "Loading...": "Cargando...",
  "Error fetching one user": "Error al obtener un usuario",
  "Default": "Predeterminado",
  "Shipping Address": "Dirección de envío",

  "searchResults": "resultados de búsqueda",
  "search": "buscar",
  "filter": "filtro",
  "searchPlaceholder": "¿Qué estás buscando?",
  "filters": "filtros",
  "minimumPrice": "precio mínimo",
  "minPrice": "precio mínimo",
  "maximumPrice": "precio máximo",
  "maxPrice": "precio máximo",
  "categories": "categorías",
  "loadingCategories": "cargando categorías",
  "errorLoadingCategories": "error al cargar las categorías",
  "materials": "materiales",
  "loadingMaterials": "cargando materiales",
  "errorLoadingMaterials": "error al cargar los materiales",
  "sortBy": "ordenar por",
  "default": "predeterminado",
  "price": "precio",
  "newest": "más nuevo",
  "inStock": "en existencia",
  "sortOrder": "orden de clasificación",
  "ascending": "ascendente",
  "descending": "descendente",
  "applyFilters": "aplicar filtros",
  "resetFilters": "restablecer filtros",
  "results": "resultados",
  "loading": "cargando",
  "errorFetchingResults": "error al obtener resultados",
  "noResultsFound": "no se encontraron resultados",

  "Profile": "Perfil",
  "Update": "Actualizar",
  "Profile updated": "Perfil actualizado",

  "Sorry. Product is out of stock": "Lo sentimos. Producto agotado",
  "Product added to cart": "Producto añadido al carrito",
  "Product Not Found": "Producto no encontrado",
  "Price": "Precio",
  "Description": "Descripción",
  "Status": "Estado",
  "In Stock": "En existencia",
  "Unavailable": "No disponible",
  "Add to Cart": "Añadir al carrito",

  "Place Order": "Realizar pedido",
  "Preview Order": "Vista previa del pedido",
  "Shipping": "Envío",
  "Edit": "Editar",
  "Payment": "Pago",
  "Method": "Método",
  "Items": "Artículos",
  "Order Summary": "Resumen del pedido",
  "Total": "Total",
  "Tax": "Impuesto",
  "Unexpected response structure from order creation API.": "Estructura de respuesta inesperada de la API de creación de pedidos.",

  "Card": "Tarjeta",
  "Payment Method": "Método de pago",
  "Bank Name": "Nombre del banco",
  "Card Number": "Número de tarjeta",
  "Year Expiration": "Año de expiración",
  "CCV": "CCV",

  "Order": "Pedido",
  "Order Not Found": "Pedido no encontrado",
  "Delivered at": "Entregado en",
  "Not Delivered": "No entregado",
  "Paid at": "Pagado en",
  "Not Paid": "No pagado",

  "Order History": "Historial de pedidos",
  "ID": "ID",
  "DATE": "FECHA",
  "TOTAL": "TOTAL",
  "PAID": "PAGADO",
  "DELIVERED": "ENTREGADO",
  "ACTIONS": "ACCIONES",
  "Details": "Detalles",
  "N/A": "N/D",
  "No": "No",

  "Wallet": "Cartera",
  "List of Payment Cards": "Lista de tarjetas de pago",
  "Add Card": "Agregar tarjeta",
  "Card Holder": "Titular de la tarjeta",
  "Expires": "Expira",
  "Expiration Date": "Fecha de expiración",

  "Company Name": "Nombre de la empresa",
  "Company Registration Number": "Número de registro de la empresa",
  "Publication Director": "Director de publicaciones",
  "Hosting Provider": "Proveedor de alojamiento",

  "errorLoadingFeaturedProducts": "error al cargar los productos destacados",

  "Subject": "Asunto",
  "Message": "Mensaje",
  "Send": "Enviar",
  "New message sent": "Nuevo mensaje enviado",

  "Shopping Cart": "Carrito de compras",
  "Cart is empty.": "El carrito está vacío.",
  "Go Shopping": "Ir de compras",
  "Subtotal": "Subtotal",
  "items": "artículos",
  "Proceed to Checkout": "Proceder al pago",

  "Addresses": "Direcciones",
  "Saved addresses": "Direcciones guardadas",
  "Add a new address": "Agregar una nueva dirección",
  "Street": "Calle",
  "Default shipping address": "Dirección de envío predeterminada",
  "Create new": "Crear nuevo",

  "Our Story": "Nuestra historia",
  "In the heart of Scotland, where the whispers of the past meet the innovations of the future, ÀIRNEIS was born. Our name, meaning \"furniture\" in Scottish Gaelic, is a tribute to our roots and a symbol of our commitment to bringing the dreams of Scotland's most visionary designers to life. Our collection is a curated symphony of timeless classics and modern masterpieces, each piece crafted with love, care, and unparalleled attention to detail.": "En el corazón de Escocia, donde los susurros del pasado se encuentran con las innovaciones del futuro, nació ÀIRNEIS. Nuestro nombre, que significa \"muebles\" en gaélico escocés, es un homenaje a nuestras raíces y un símbolo de nuestro compromiso de llevar a la realidad los sueños de los diseñadores más visionarios de Escocia. Nuestra colección es una sinfonía curada de clásicos atemporales y obras maestras modernas, cada pieza elaborada con amor, cuidado y una atención al detalle sin igual.",
  "From our humble beginnings as a small, family-run business, ÀIRNEIS has always been more than just a furniture company. It's a legacy of craftsmanship, a celebration of Scottish heritage, and a journey of innovation. We started by sharing our creations through mail order and a handful of partner retailers, cherishing every connection made, every piece that found a new home.": "Desde nuestros humildes comienzos como una pequeña empresa familiar, ÀIRNEIS siempre ha sido más que una simple empresa de muebles. Es un legado de artesanía, una celebración de la herencia escocesa y un viaje de innovación. Comenzamos compartiendo nuestras creaciones a través de pedidos por correo y algunos minoristas asociados, apreciando cada conexión realizada, cada pieza que encontró un nuevo hogar.",
  "Embracing the winds of change, we've recently taken a bold step into the digital world with the launch of our online store. This new chapter allows us to weave our stories into the fabric of homes around the globe, connecting with those who share our passion for design that transcends time and borders. It's an invitation to discover the perfect piece that speaks to you, to bring a piece of Scotland into your life.": "Abrazando los vientos del cambio, recientemente hemos dado un paso audaz hacia el mundo digital con el lanzamiento de nuestra tienda en línea. Este nuevo capítulo nos permite tejer nuestras historias en el tejido de hogares alrededor del mundo, conectando con aquellos que comparten nuestra pasión por un diseño que trasciende el tiempo y las fronteras. Es una invitación a descubrir la pieza perfecta que te hable, para traer un pedazo de Escocia a tu vida.",
  "Your joy and satisfaction fuel our journey, and we are here to guide, inspire, and listen. Welcome to ÀIRNEIS, a place where tradition dances with innovation, and every piece tells a story waiting to become a part of yours.": "Tu alegría y satisfacción impulsan nuestro viaje, y estamos aquí para guiar, inspirar y escuchar. Bienvenido a ÀIRNEIS, un lugar donde la tradición baila con la innovación, y cada pieza cuenta una historia esperando convertirse en parte de la tuya.",
  "With heartfelt warmth,": "Con cálido afecto,",
  "The ÀIRNEIS Family": "La familia ÀIRNEIS",

  "Sofas": "Sofás",
  "Tables": "Mesas",
  "Bookcases": "Libreros",
  "Rugs": "Alfombras",
  "Lamps": "Lámparas",
  "Wardrobes": "Armarios",

  "Cotton": "Algodón",
  "Wood": "Madera",
  "Metal": "Metal",
  "Wool": "Lana",
  "Glass": "Vidrio",

  "Discover the beauty of outdoor living with our garden range": "Descubre la belleza de la vida al aire libre con nuestra gama de jardín",
  "Explore our latest bedroom furniture collections": "Explora nuestras últimas colecciones de mobiliario de dormitorio",
  "Transform your living space with our contemporary designs": "Transforma tu espacio de vida con nuestros diseños contemporáneos",
  
  "Discover the ultimate comfort with our luxurious sofa collection, perfect for elevating your living space.": "Descubre el confort último con nuestra colección de sofás lujosos, perfecta para elevar tu espacio de vida.",
  "Elevate your dining experience with our stylish and functional tables, designed to fit any space.": "Eleva tu experiencia de comida con nuestras mesas estilosas y funcionales, diseñadas para cualquier espacio.",
  "Organize your favorite reads and accentuate your space with our elegant and versatile bookcases.": "Organiza tus lecturas favoritas y aumenta el espacio con nuestros libreros elegantes y versátiles.",
  "Add a touch of warmth and style to any room with our exquisite collection of rugs.": "Añade un toque de calor y estilo a cualquier habitación con nuestra colección excepcional de alfombras.",
  "Illuminate your home with our range of beautiful and functional lamps, perfect for setting the mood.": "Ilumina tu casa con nuestra gama de lámparas hermosas y funcionales, perfectas para establecer el ambiente.",
  "Keep your clothes organized and your bedroom tidy with our stylish and spacious wardrobes.": "Mantén tus prendas organizadas y tu dormitorio limpio con nuestros armarios estilosos y espaciosos.",

  "Sign-In": "Iniciar sesión",
  "We use functional cookies to ensure the best experience on our website.": "Utilizamos cookies funcionales para asegurar la mejor experiencia en nuestro sitio web.",
  "OK": "Aceptar",
  "Back to Sign In": "Volver a Iniciar sesión",
  "Processing your request...": "Procesando tu solicitud...",
  "Reset link has been sent to your email. You will be redirected to the sign-in page shortly.": "Un enlace de restablecimiento ha sido enviado a tu correo electrónico. Serás redirigido a la página de inicio de sesión en breve.",
  "Password reset successful. You will be redirected to the login page in a few seconds.": "Restablecimiento de contraseña exitoso. Serás redirigido a la página de inicio de sesión en breve.",

  "Password Strength": "Fuerza de la contraseña",
  "Weak": "Débil",
  "Strong": "Fuerte",
  "Password must be at least 8 characters long.": "La contraseña debe tener al menos 8 caracteres.",
  "Password should include at least one letter.": "La contraseña debe incluir al menos una letra.",
  "Password should include at least one number.": "La contraseña debe incluir al menos un número.",
  "Password should include at least one special character.": "La contraseña debe incluir al menos un carácter especial."
}
